function randomJokeGenerator(){
    jokes_urdu = [
        "ایک بچہ اپنی ماں سے: ماں مجھے اپنی ننھی سی کیا داستان سناؤ۔ ماں: بیٹا جب میں چھوٹی تھی تو میں نے تیری دادی سے کہا تھا کہ میں بڑی ہو کر کیا بنوں گی؟ تیری دادی نے کہا تھا بیٹا جب تو بڑی ہو جائی گی تو اپنی ننھی سی داستان سنائیں گی۔",
        "ایک ادبی اجلاس میں محمود حسن دیسی ایک گانے کو پڑھنے لگے اور گانے کے بیچ میں ہنسی کرنے لگے، پھر انہوں نے بھی اپنی مزید ہنسی کو روکا اور کہا: دوستوں! اس انتہائی حسین گانے کو دیکھ کر مجھے اپنے گانے کے خاطر بھی رونا آگیا ہے۔",
        "ایک محبوبہ نے شوہر سے کہا: آپ میرے لئے کیا خوشگوار سوچتے ہیں؟ شوہر: جی اپنے خوابوں میں تمہارے بغیر کتنی خوشیاں دیکھتا ہوں۔ محبوبہ: واہ! یہ کیسا پیار ہے۔ شوہر: ہاں، خوابوں میں تو میں روز تمہاری دانت بھی بناتا ہوں۔",
        "بیٹا: بابا، آپ کو پتا ہے کالے کتے کی داستان؟ بابا: جی ہاں، کیا سننا ہے؟ بیٹا: وہ کہتے ہیں کہ کالا کتا رات کو چھپ کر آتا ہے اور بچوں کو کھال کر لے جاتا ہے۔ بابا: لیکن بیٹا، کالا کتا تو بس ایک افسانہ ہے۔ بیٹا: آپ کو تو معلوم ہو گا، مجھے تو دعوت ملی ہوئی ہے۔"
    ]
    let ramdomJoke = Math.random() * jokes_urdu.length;
    let roundJoke = Math.floor(ramdomJoke)
    let ramdomGen = jokes_urdu[roundJoke]
    // console.log(ramdomGen);
    let joke = document.querySelector("#joke")
    joke.innerText = `" ${ramdomGen} 😂"`
}
